// 1
// Заполнить массив А случайными числами (диазпазон на ваше усмотрение). 
// Заменить каждый элемент массива с четным ИНДЕКСОМ на звездочку *

// let mass = [];
// mass.length = 10;
// for(let i = 0; i < mass.length; i++) {
// 	mass[i] = Math.floor(Math.random() * (100 - 10) + 10);
// 	if (i % 2 == 0) mass[i] = "*"
// }
// console.log(mass)

// 2.Создать массив размерностью n
// n принять от пользователя (тут проверку на число можно не делать).
// Заполнить массив значениями с клавиатуры.
// Если введенное значение пользователя не число (см. урок 2), или отрицательное значение, 
// то запросить повторный ввод данных (повторный ввод в ту же ячейку массива). 

// let n = +prompt("Введите размер массива")
// let mass = new Array(n);
// for (i=0;i<=n-1;i++)
// {
// 		mass[i] = +prompt("Введите число");
// }
// console.log(mass);

// 3.
// В двумерном массиве A размером 5 на 10. Заполнить случайными числами.
// Найти ряд, где сумма элементов наименьшая
// Найти ряд, где сумма элементов найбольшая
// Вывод на экран:
// Минимальная сумма чисел Summa в массиве c индексом X
// Максимальная сумма чисел Summa в массиве c индексом Y

// 4.
// ['January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October','November', 'December']
// Создать программу, выполняющую вставку элемента в массив (например, свой собственный месяц в году) 
// после элемента (после какого месяца), значение которого укажет пользователь.
// Вывести на экран в виде списка
